{"performance": 0, "overview": 1, "business": 2, "highlights": 3, "fy": 4, "2023": 5, "46": 6, "767": 7, "24": 8, "095": 9, "57": 10, "63": 11, "92": 12, "394": 13, "revenues": 14, "20": 15, "growth": 16, "15": 17, "cc": 18, "digital": 19, "total": 20, "revenue": 21, "62": 22, "25": 23, "28": 24, "u20b9": 25, "cr": 26, "18": 27, "212": 28, "981": 29, "71": 30, "72": 31, "351": 32, "operating": 33, "margin": 34, "21": 35, "robust": 36, "basic": 37, "earnings": 38, "per": 39, "share": 40, "par": 41, "value": 42, "consolidated": 43, "cash": 44, "investments": 45, "31": 46, "286cr": 47, "continue": 48, "main": 49, "strong": 50, "liquidity": 51, "position": 52, "dividend": 53, "34": 54, "infosys": 55, "achieved": 56, "industry": 57, "leading": 58, "healthy": 59, "fiscal": 60, "esg": 61, "vision": 62, "2030": 63, "ambitions": 64, "drive": 65, "stakeholders": 66, "buyback": 67, "completed": 68, "300cr": 69, "average": 70, "price": 71, "539": 72, "06": 73, "return": 74, "equity": 75, "improved": 76, "last": 77, "free": 78, "443cr": 79, "fcf": 80, "conversion": 81, "84": 82, "net": 83, "profit": 84, "large": 85, "deal": 86, "tcv": 87, "contract": 88, "us": 89, "billion": 90, "sustained": 91, "momentum": 92, "wins": 93, "continues": 94, "number": 95, "50": 96, "million": 97, "clients": 98, "75": 99, "client": 100, "metrics": 101, "increase": 102, "11": 103, "integrated": 104, "annual": 105, "report": 106, "2022": 107, "23": 108, "tech": 109, "good": 110, "114mn": 111, "lives": 112, "empowered": 113, "via": 114, "solutions": 115, "governance": 116, "education": 117, "healthcare": 118, "carbon": 119, "neutrality": 120, "neutral": 121, "years": 122, "row": 123, "scope": 124, "emissions": 125, "note": 126, "flow": 127, "defined": 128, "provided": 129, "activities": 130, "less": 131, "capital": 132, "expenditure": 133, "statement": 134, "flows": 135, "prepared": 136, "ifrs": 137, "comprise": 138, "equivalents": 139, "current": 140, "non": 141, "excluding": 142, "unquoted": 143, "preference": 144, "shares": 145, "others": 146, "key": 147, "trends": 148, "type": 149, "columnheader": 150, "row_index": 151, "column_index": 152, "row_span": 153, "column_span": 154, "content": 155, "crore": 156, "except": 157, "data": 158, "bbox_format": 159, "x1": 160, "y1": 161, "x2": 162, "y2": 163, "bbox": 164, "2021": 165, "2020": 166, "2019": 167, "641": 168, "00": 169, "472": 170, "90": 171, "791": 172, "82": 173, "675": 174, "22": 175, "110": 176, "19": 177, "16": 178, "594": 179, "404": 180, "52": 181, "45": 182, "61": 183, "38": 184, "97": 185, "3544": 186, "market": 187, "capitalization": 188, "592": 189, "02": 190, "162": 191, "880": 192, "73": 193, "214": 194, "448": 195, "311": 196, "13": 197, "561": 198, "12": 199, "780": 200, "799": 201, "963": 202, "613": 203, "331": 204, "199": 205, "70": 206, "55": 207, "51": 208, "10": 209, "104": 210, "706": 211, "79": 212, "760": 213, "966": 214, "47": 215, "614": 216, "notes": 217, "based": 218, "financial": 219, "statements": 220, "attributable": 221, "owners": 222, "company": 223, "offset": 224, "programs": 225, "40": 226, "000": 227, "rural": 228, "families": 229, "benefit": 230, "women": 231, "employees": 232, "39": 233, "steady": 234, "progress": 235, "towards": 236, "gender": 237, "diversity": 238, "goals": 239, "skilling": 240, "mn": 241, "people": 242, "part": 243, "initiatives": 244, "springhiard": 245, "fresh": 246, "graduates": 247, "hired": 248, "globally": 249, "29": 250, "chairman": 251, "message": 252, "navigating": 253, "uncertainty": 254, "one": 255, "overriding": 256, "theme": 257, "defines": 258, "world": 259, "suffused": 260, "placid": 261, "predictable": 262, "behind": 263, "new": 264, "day": 265, "brings": 266, "inputs": 267, "events": 268, "derail": 269, "carefully": 270, "crafted": 271, "models": 272, "constructed": 273, "around": 274, "cocktail": 275, "inflation": 276, "interest": 277, "rates": 278, "geopolitics": 279, "war": 280, "demand": 281, "volatility": 282, "supply": 283, "chain": 284, "dislocations": 285, "shift": 286, "efficiency": 287, "resilience": 288, "security": 289, "stirring": 290, "quickly": 291, "without": 292, "warning": 293, "week": 294, "may": 295, "oscillate": 296, "caution": 297, "optimism": 298, "back": 299, "news": 300, "times": 301, "intense": 302, "great": 303, "short": 304, "term": 305, "pressure": 306, "crunched": 307, "resources": 308, "require": 309, "companies": 310, "must": 311, "become": 312, "better": 313, "efficient": 314, "ability": 315, "resilient": 316, "present": 317, "also": 318, "securing": 319, "future": 320, "easier": 321, "said": 322, "done": 323, "extreme": 324, "surrounds": 325, "creates": 326, "many": 327, "probable": 328, "states": 329, "simply": 330, "prudent": 331, "businesses": 332, "plan": 333, "succeed": 334, "anticipated": 335, "scenario": 336, "instead": 337, "need": 338, "develop": 339, "flexibility": 340, "able": 341, "avoid": 342, "limiting": 343, "choices": 344, "reduce": 345, "concentration": 346, "risk": 347, "adapt": 348, "learn": 349, "thrive": 350, "reality": 351, "era": 352, "optionality": 353, "upon": 354, "take": 355, "various": 356, "forms": 357, "infrastructure": 358, "dynamically": 359, "reconfigure": 360, "way": 361, "work": 362, "remotely": 363, "office": 364, "hybrid": 365, "area": 366, "talent": 367, "building": 368, "deploying": 369, "agile": 370, "learning": 371, "platforms": 372, "hone": 373, "skill": 374, "sets": 375, "match": 376, "technologies": 377, "first": 378, "ai": 379, "architecture": 380, "constantly": 381, "configured": 382, "finding": 383, "right": 384, "balance": 385, "retaining": 386, "core": 387, "working": 388, "partners": 389, "ingrained": 390, "strategy": 391, "execution": 392, "ceo": 393, "salil": 394, "parekh": 395, "global": 396, "leadership": 397, "team": 398, "realized": 399, "early": 400, "advanced": 401, "like": 402, "cloud": 403, "recently": 404, "generative": 405, "bring": 406, "imagine": 407, "execute": 408, "multiple": 409, "options": 410, "came": 411, "together": 412, "orchestrate": 413, "teams": 414, "lead": 415, "charge": 416, "continually": 417, "transform": 418, "organization": 419, "truly": 420, "realizes": 421, "human": 422, "machine": 423, "synergies": 424, "fundamentally": 425, "rethinking": 426, "organizational": 427, "design": 428, "segmenting": 429, "cognitive": 430, "tasks": 431, "get": 432, "technology": 433, "process": 434, "today": 435, "steadily": 436, "progressing": 437, "solve": 438, "immediate": 439, "30": 440, "problems": 441, "innovate": 442, "architect": 443, "challenges": 444, "emerge": 445, "build": 446, "deeply": 447, "rooted": 448, "experience": 449, "widely": 450, "awesome": 451, "possibilities": 452, "know": 453, "journey": 454, "becoming": 455, "enterprise": 456, "risks": 457, "hallucination": 458, "systemic": 459, "biases": 460, "lack": 461, "explainability": 462, "along": 463, "plenty": 464, "practical": 465, "ethical": 466, "intellectual": 467, "property": 468, "related": 469, "issues": 470, "remain": 471, "open": 472, "debate": 473, "path": 474, "scaling": 475, "wide": 476, "linear": 477, "often": 478, "organizations": 479, "seeking": 480, "mine": 481, "successfully": 482, "undertake": 483, "pilots": 484, "fail": 485, "factor": 486, "scale": 487, "across": 488, "whole": 489, "demands": 490, "volumes": 491, "grow": 492, "complexity": 493, "rises": 494, "find": 495, "unable": 496, "surmount": 497, "associated": 498, "start": 499, "question": 500, "larger": 501, "strategic": 502, "breaking": 503, "sequential": 504, "small": 505, "always": 506, "intuitive": 507, "simple": 508, "guided": 509, "road": 510, "map": 511, "bringing": 512, "accelerate": 513, "amplify": 514, "potential": 515, "using": 516, "topaztm": 517, "transformation": 518, "every": 519, "several": 520, "laid": 521, "foundation": 522, "create": 523, "navigate": 524, "forward": 525, "trusted": 526, "assist": 527, "make": 528, "safeguard": 529, "excited": 530, "opportunity": 531, "humbled": 532, "responsibility": 533, "enable": 534, "capabilities": 535, "effectively": 536, "developing": 537, "competitive": 538, "advantage": 539, "uncertain": 540, "relevance": 541, "never": 542, "compelling": 543, "investment": 544, "continuous": 545, "consistent": 546, "purpose": 547, "keen": 548, "ready": 549, "co": 550, "entire": 551, "ecosystem": 552, "flexible": 553, "puts": 554, "benefits": 555, "broader": 556, "society": 557, "even": 558, "propels": 559, "imagination": 560, "invisible": 561, "power": 562, "things": 563, "bright": 564, "nandan": 565, "nilekani": 566, "bengaluru": 567, "letter": 568, "shareholder": 569, "dear": 570, "year": 571, "fy23": 572, "saw": 573, "margins": 574, "attrition": 575, "reduced": 576, "quarter": 577, "changing": 578, "economic": 579, "environment": 580, "positioned": 581, "well": 582, "cost": 583, "automation": 584, "enabling": 585, "support": 586, "two": 587, "critical": 588, "areas": 589, "developed": 590, "set": 591, "artificial": 592, "intelligence": 593, "enhance": 594, "derive": 595, "available": 596, "form": 597, "cobalt": 598, "resonate": 599, "including": 600, "finacle": 601, "banks": 602, "mccamish": 603, "insurance": 604, "equinox": 605, "commerce": 606, "helix": 607, "creating": 608, "impact": 609, "recognized": 610, "brand": 611, "finance": 612, "among": 613, "top": 614, "three": 615, "valuable": 616, "services": 617, "brands": 618, "deepen": 619, "engagement": 620, "100": 621, "intensity": 622, "95": 623, "deals": 624, "see": 625, "approach": 626, "helping": 627, "strength": 628, "employee": 629, "base": 630, "recruited": 631, "college": 632, "ended": 633, "end": 634, "32": 635, "enabled": 636, "days": 637, "returned": 638, "shareholders": 639, "program": 640, "peers": 641, "past": 642, "five": 643, "committed": 644, "communities": 645, "live": 646, "operate": 647, "variety": 648, "social": 649, "causes": 650, "positive": 651, "sustainability": 652, "empowerment": 653, "springboard": 654, "initiative": 655, "help": 656, "skills": 657, "providing": 658, "millions": 659, "quarters": 660, "seen": 661, "economy": 662, "dealing": 663, "rate": 664, "increases": 665, "changes": 666, "industries": 667, "held": 668, "stead": 669, "evolving": 670, "look": 671, "ahead": 672, "given": 673, "trust": 674, "dedication": 675, "guidance": 676, "board": 677, "confident": 678, "serve": 679, "warmest": 680, "regards": 681, "viay": 682, "2025": 683, "chier": 684, "executive": 685, "ofricer": 686, "ivial": 687, "sd": 688, "chief": 689, "officer": 690, "managing": 691, "director": 692, "33": 693, "awards": 694, "recognitions": 695, "constituent": 696, "dow": 697, "jones": 698, "index": 699, "secured": 700, "place": 701, "cdp": 702, "list": 703, "corporate": 704, "transparency": 705, "climate": 706, "change": 707, "tor": 708, "advisory": 709, "servi": 710, "grrernance": 711, "category": 712, "indian": 713, "scorecard": 714, "assessment": 715, "institutional": 716, "investor": 717, "iias": 718, "seventh": 719, "honored": 720, "asset": 721, "platinum": 722, "award": 723, "excellence": 724, "best": 725, "relations": 726, "inclusion": 727, "environmental": 728, "ethisphere": 729, "awarded": 730, "hfs": 731, "oneoffice": 732, "leader": 733, "everest": 734, "enablement": 735, "peak": 736, "matrix": 737, "ranked": 738, "bpm": 739, "csr": 740, "summit": 741, "ubs": 742, "forum": 743, "performer": 744, "sustainalytics": 745, "topped": 746, "charts": 747, "crisil": 748, "rankings": 749, "featured": 750, "yearbook": 751, "second": 752, "consecutive": 753, "aa": 754, "rating": 755, "msci": 756, "ecovadis": 757, "gold": 758, "medal": 759, "150": 760, "valued": 761, "500": 762, "brandon": 763, "hall": 764, "group": 765, "hcm": 766, "ny": 767, "groue": 768, "employer": 769, "countries": 770, "europe": 771, "middle": 772, "east": 773, "asia": 774, "pacific": 775, "north": 776, "america": 777, "class": 778, "hr": 779, "practices": 780, "processes": 781, "outstanding": 782, "india": 783, "sector": 784, "poll": 785, "asiamoney": 786, "seramount": 787, "fe": 788, "cfo": 789, "enterprises": 790, "servicing": 791, "treasury": 792, "adam": 793, "smith": 794, "named": 795, "avtar": 796, "kantar": 797, "uk": 798, "workplaces": 799, "mexico": 800, "leaders": 801, "tp": 802, "certified": 803, "conditions": 804, "employers": 805, "institute": 806, "3rd": 807, "received": 808, "certification": 809, "regions": 810, "australia": 811, "united": 812, "kingdom": 813, "germany": 814, "usa": 815, "canada": 816, "philippines": 817, "receiving": 818, "instep": 819, "internship": 820, "vault": 821, "firsthand": 822, "rated": 823, "noteworthy": 824, "diversityinc": 825, "amongst": 826, "icai": 827, "reporting": 828, "equality": 829, "champion": 830, "inclusive": 831, "mici": 832, "fame": 833, "ac": 834, "nation": 835, "builders": 836, "202": 837, "markets": 838, "winner": 839, "innovation": 840, "gsi": 841, "partner": 842, "snowflake": 843, "microsoft": 844, "modern": 845, "endpoint": 846, "management": 847, "service": 848, "provider": 849, "nordics": 850, "whitelane": 851, "research": 852, "pa": 853, "consulting": 854, "sourcing": 855, "study": 856, "international": 857, "project": 858, "telefonica": 859, "association": 860, "gsa": 861, "voice": 862, "customer": 863, "wrs": 864, "35": 865}