{"9c8a354c-9e78-46ba-b3ff-20b54f7630c6": {"content": "Strategy\nOur clients and prospective clients are faced with  transformative business opportunities due to advances in  software and computing technology. These organizations  are dealing with the challenge of having to reinvent  their core offerings, processes and systems rapidly and  position themselves as 'digitally enabled'. The journey to  the digital future requires not just an understanding of  new technologies and new ways of working, but a deep  appreciation of existing technology landscapes, business  processes and practices. Our strategy is to be a navigator  for our clients as they ideate, plan and execute their  journey to a digital future. We have embraced a four-pronged strategy to strengthen  our relevance with clients and drive accelerated  value creation:\nEnergize the core We believe the investments we have made, and continue  to make, in our strategy will enable us to advise and help  our clients as they tackle the current market conditions.  Further, we have been able to successfully enable most of  our employees worldwide to work remotely and securely  – giving us the operational stability to deliver on client  commitments and ensuring our own business continuity. Over the last four years, we have executed this strategy  and generated significant outcomes.\nScale agile digital Our revenue from digital technology-related services  and solutions has more than doubled in the last three  years, and currently comprises 57% of our total revenue.  We are rated as a leader in 54 industry analyst ratings  across our digital offerings. These outcomes are a result  of investments we have made to expand our digital  footprint via reskilling of our employees, targeted  acquisitions, strong ecosystem partnerships, innovation  experience centers across the world, intellectual property  development, reconfiguring our workspaces for agile  software development and enhancing our brand.\nScale agile digital\nReskill our people\nExpand localization\nOur human experience-related services expanded with  the opening of eight innovation hubs, six digital studios,  12 proximity centers and 20 living labs around the world.  During the fiscal, we entered into a definitive agreement  to acquire oddity to augment our human experience  capabilities in Europe. Through our academia partnerships  with Purdue, Trinity, RISD and eCornell, we have trained  over 4,500 employees in niche digital skills. Our Insight and data analytics services and solutions  were further strengthened with the launch of our Infosys  Applied AI solutions, coupled with the Infosys Data  Workbench. Our AI platform, Infosys Applied AI, helps  enterprises adopt a comprehensive approach and roadmap  to scaling enterprise-grade AI for their businesses.  With advances in next-generation computing power, ready  access to datasets on the cloud to train Machine Learning  models and consumable Artificial Intelligence (AI) services,  our solutions enable our clients to generate insights from  their data and open opportunities for data monetization. Our Innovate-related services and solutions are boosted  by workspaces that have been specifically redesigned  for agile software development, teams reskilled in agile  methodologies, certified scrum masters and capabilities  in horizontal technologies such as 5G, autonomous tech,  product engineering, internet of things and blockchain. Our Accelerate-related services are aimed at rapidly  transforming our clients’ legacy technology landscapes  and processes with digital technology. We invested in, and  built strong partnerships with cloud hyperscalers such as  AWS, GCP and Microsoft Azure, and SaaS providers.  In fiscal 2022, we expanded our integrated cloud offering  Infosys Cobalt™, which now offers over 35,000 cloud  assets and over 300 industry cloud solution blueprints.  Infosys Cobalt™ is helping enterprises to securely access  cloud capabilities with the assurance of single-point  accountability for outcomes. We launched Infosys Equinox, our flagship digital  commerce platform, which is a set of core microservices  encompassing all digital commerce scenarios to help  enterprises rapidly build and deploy features across all  touchpoints and channels, without the friction associated  with legacy platforms. Our Automation and AI services grew on the back of our  alliances with leading Robotic Process Automation (RPA)  solution providers and niche AI players, powered by our\nStrategy\nbest-in-class solutions, IPs and frameworks. We have  automated over 20,000+ processes for our clients and have  over 1,000 ready use cases across industries. Our Assure services, in software testing and cybersecurity,  continued to grow with investments in Cyber Gaze, our  cybersecurity dashboard and suite of related applications.\nEnergize the core Leveraging automation and AI, we are winning and  executing several engagements for our clients to  modernize their core legacy technology and process  landscapes. We made significant investments in our  Live Enterprise platform, including our Bot Factory of  preconfigured automation bots and LEAP, our platform  for optimizing large-scale application maintenance and  reengineering. In fiscal 2022, we won a total contract  value of over US$ 9.5 billion in large deals, continuing  to demonstrate our capabilities and competitiveness in  executing complex transformation programs. In addition,  investments in our own internal systems, reimagination  of our internal processes and automation of software  development processes have helped increase our agility,  boost productivity and enhance our competitiveness even  in the current paradigm of remote working.\nReskill our people Continuous learning and reskilling have always  been integral to our operating model. We operate  our reskilling program with the twin objectives of  increasing fulfillment of demand for digital skills in  client projects and for enriching the expertise of our  global workforce in next-generation technologies and  methodologies. We invested in, and scaled, our digital  reskilling program globally. Lex, our in-house-developed,  anytime-anywhere-learning platform, offers over  13,700 courses curated for easy consumption on mobile  devices with advanced telemetry, gamification and  certification features. Over 2,99,000 of our employees use  Lex and are spending approximately 2.3 million training  days compared to 1.9 million in the last fiscal with close to  45 minutes per day on average for learning activities.\nExpand localization With the objective of creating differentiated talent pools  in our markets, we made significant investments in  expanding our local workforce in the US, the UK, Europe,  Japan, China and Australia. We established innovation  hubs, nearshore centers and digital design studios across  geographies. Further, we expanded our university and  community college partnerships in all these regions to  aid internships, recruitment, training and joint research.  In fiscal 2022, we recruited over 14,805 employees locally  in our markets, of which 3,650 were fresh graduates.  This initiative also significantly de-risks our operations from  regulatory changes related to immigration policies. Looking ahead, and to continue staying relevant to the  emerging needs of our clients, our strategic areas of focus  for the next few years will be to further: • Scale our cloud capabilities, especially around cloud  advisory, data on cloud, cloud security, SaaS, PaaS, IaaS  and private cloud; • Expand capabilities in key digital technology areas  such as AI, product engineering, cybersecurity and  human experience; • Strengthen our employee value proposition for the  newer contexts of work and workplace; • Run our operations in a cost-effective and agile manner,  including increasing the levels of automation in our  service delivery; • Deliver on our ESG commitments, while at the  same time enabling our clients to realize their  sustainability goals.\n[{\"\": null, \"null\": \"\"}]", "metadata": {"source": "/data/vectordb/chunked/1c8e1d10-3258-42f1-801d-59e54456ae18/chunks/1.txt", "chunk_id": "c4e5e", "page_no": 1, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [189.0, 385.0, 4920.0, 2929.0], "doc_name": "AR_2021-22_page-20-21.pdf", "document_id": "1c8e1d10-3258-42f1-801d-59e54456ae18"}}, "c7b2598b-2077-4c02-8e34-80256c5843ad": {"content": "Business highlights\nDifferentiated cloud services and large deal momentum drive Infosys’ highest annual   growth in a decade. Our ESG Vision 2030 and ambitions continue to drive value for   all our stakeholders.\nRevenues (in ` crore) 1,21,641 21.1% growth Y-o-Y   19.7% CC growth Y-o-Y\nFree cash flows (in ` crore) (1)\n22,803 3.6% growth Y-o-Y FCF conversion at 103%   of net profit\nTotal shareholder return 41.6% Generated higher returns  than market\nLarge deal TCV  (Total contract value in US$ billion) 9.5 Sustained momentum in  large deal wins\nDigital skilling 4.8 million People are a part of our digital  skilling initiatives\nOperating margin 23.0% Robust operating margin\nConsolidated cash and investments  (in ` crore) (2)\n37,419 Continue to maintain strong  liquidity position\nBasic earnings per share   (par value of `5 each) 52.52 15.2% growth Y-o-Y\nNumber of US$ 100 million+ clients 38 Increase of 6 clients Y-o-Y\nTech for Good 80 million+ People empowered through our Tech for Good solutions in e-governance,   education and healthcare\nDigital revenues   (as a % of total revenue) 57.0% 41.2% CC growth Y-o-Y (basis US$)\nReturn on equity 29.1% Improved by 1.7%   over the last fiscal\nDividend per share (in `) 31.0 14.8% growth Y-o-Y\nWomen employees 39.6% Steady progress towards gender  diversity goals\nCarbon neutrality Carbon neutral   for 3 years   in a row Scope 1, 2 and 3 emissions\nNote: (1) Free cash flow is defined as net cash provided by operating activities less capital expenditure as per the Consolidated Statement of Cash Flows prepared under IFRS. (2) Comprise cash and cash equivalents, current and non-current investments excluding investments in unquoted equity and preference shares, compulsorily convertible debentures and others\nKey trends In ` crore, except per equity share data Revenues (1) Net profit (1)(2) Basic earnings per share (in `) (1) Market capitalization\nIn US$ million, except per equity share data Revenues (1) Net profit (1)(2) Basic earnings per share (in US$) (1) Market capitalization\nNotes: (1) Based on IFRS consolidated financial statements (2) Attributable to owners of the Company\nFresh college graduates hired 84,782 Globally\nFY 2022 1,21,641 22,110 52.52 8,02,162\nFY 2022 16,311 2,963 0.70 104,706\nFY 2021 1,00,472 19,351 45.61 5,82,880\nFY 2021 13,561 2,613 0.62 79,760\nCarbon offset programs 1,84,000 Rural families continue to benefit  from our carbon offset programs\nFY 2020 90,791 16,594 38.97 2,73,214\nFY 2020 12,780 2,331 0.55 34,966\nFY 2019 82,675 15,404 35.44 3,24,448\nFY 2018 70,522 16,029 35.53  2,47,198\nFY 2019 11,799 2,199 0.51 47,614\nFY 2018 10,939 2,486 0.55 19,493", "metadata": {"source": "/data/vectordb/chunked/1c8e1d10-3258-42f1-801d-59e54456ae18/chunks/2.txt", "chunk_id": "07f53", "page_no": 2, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [189.0, 393.0, 4896.0, 3041.0], "doc_name": "AR_2021-22_page-20-21.pdf", "document_id": "1c8e1d10-3258-42f1-801d-59e54456ae18"}}, "d98d1317-cee5-439b-ae93-40336188f8c7": {"content": "Business highlights\nRevenues ?1 20.7% growth Y-o-Y  15.4% CC growth Y-o-Y\nDigital revenues  (as a % of total revenue) 62.2 25.6% CC growth Y-o-Y\nOperating margin 21.0 Robust operating margin\nBasic earnings per share (par value of ? 5 each) 57.63 9.7% growth Y-o-Y\nConsolidated cash and  investments(2) ? 31,286cr Continue to main strong  liquidity position\nDividend per share (in ?) 34.0 9.7% growth Y-o-Y\nInfosys achieved industry- leading revenue growth of  15.4% with healthy operating  margin of 21.0% for fiscal  2023. Our ESG Vision 2030 and  ambitions continue to drive  value for all our stakeholders.\nBuyback completed ? 9,300cr at an average price of ? 1,539.06\nReturn on equity 31.2% Improved by 2.1% over  the last fiscal\nFree cash(1) ? 20,443cr  FCF conversion at 84.8% of net profit\nLarge deal TCV (Total contract value in US$ billion) b $9.8 Sustained momentum in large  deal wins continues\nNumber of US$ 50 million + clients 75 Strong client metrics with increase   of 11 clients Y-o-Y\nTech for Good 114mn + Lives empowered via our Tech for  Good solutions in e-governance,  education and healthcare\nCarbon neutrality Carbon neutral for  4 years in a row Scope 1, 2 and 3 emissions\nNote: (1)  Free cash flow is defined as net cash provided by operating activities less capital expenditure as per the Consolidated Statement of Cash Flows  prepared under IFRS. (2)  Comprise cash and cash equivalents, current and non-current investments excluding investments in unquoted equity and preference shares, and others.\nKey trends In ? crore, except per equity share data Revenues(1) Net profit(1)(2) Basic earnings per share (in ?)(1) Market capitalization In US$ million, except per equity share data Revenues(1) Net profit(1)(2) Basic earnings per share (in ?)(1) Market capitalization Notes: (1) Based on IFRS consolidated financial statements (2) Attributable to owners of the Company\nWomen employees 39.4% Steady progress towards  gender diversity goals\nCarbon offset programs 2,40,000+ Rural families continue to benefit\n[{\"FY 2023\": \"1,46,767\"}, {\"FY 2023\": \"24,095\"}, {\"FY 2023\": \"57.63\"}, {\"FY 2023\": \"5,92,394\"}]\n[{\"FY 2023\": \"18,212\"}, {\"FY 2023\": \"2,981\"}, {\"FY 2023\": \"0.71\"}, {\"FY 2023\": \"72,351\"}]\nFY 2022 1,21,641 22,110 52.52 8,02,162 FY 2022 16,311 2,963 0.70 104,706\nINfosys | Springhiard\nDigital skilling 8.5mn People are a part of our digital  skilling initiatives\n~50,000 Fresh graduates hired globally\nFY 2021 1,00,472 19,351 45.61 5,82,880 FY 2021 13,561 2,613 0.62 79,760\nFY 2020 90,791 16,594 38.97 2,73,214 FY 2020 12,780 2,331 0.55 34,966\nFY 2019 82,675  15,404 35.44  3,24,448  FY 2019 11,799  2,199 0.51  47,614", "metadata": {"source": "/data/vectordb/chunked/c001329c-5523-42f2-a259-212dd9179611/chunks/1.txt", "chunk_id": "edeab", "page_no": 1, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [189.0, 224.0, 4902.0, 3093.0], "doc_name": "AR_2022-23_page-14-17.pdf", "document_id": "c001329c-5523-42f2-a259-212dd9179611"}}, "3f352af2-8a5e-4e75-84cc-f129f1abdab8": {"content": "Chairman’s message\nNavigating uncertainty If there is one overriding theme that defines our current  world, it is that it is suffused with uncertainty. The placid  and the predictable are behind us as each new day brings  new inputs and new events that derail the carefully-crafted  models we have constructed of the world around us. The  cocktail of inflation, interest rates, geopolitics, war, demand  volatility, supply chain dislocations, the shift from efficiency  to resilience and security, all stirring quickly and without  warning, is what’s before us. In any week, we may oscillate  from caution to optimism and back to caution based on  the news of the day.  Such times of intense uncertainty, great short-term  pressure, and crunched resources require that companies  must become better, more efficient in their ability to be  resilient in the present while also securing their future  growth. This is easier said than done. The extreme volatility  that surrounds us creates so many probable future states,  that it simply isn’t prudent for businesses to plan to  succeed in any one anticipated future scenario. Instead, we  need to develop the flexibility to be able to avoid limiting  choices, reduce concentration risk, quickly adapt, and learn  to thrive in any new reality.  The era of optionality is upon us. Optionality can take various forms. In our IT infrastructure,  it is the ability to dynamically reconfigure the way we  work – remotely, in office or hybrid. In the area of talent, it  is about building and deploying agile learning platforms  so that our people can hone their skill sets to match  new demand and new technologies. It is about having a  digital-first and AI-first business architecture which can  be constantly configured. It is finding the right balance  between retaining the core of a company and working  with partners on others. Optionality must be ingrained in  strategy and execution. Our CEO, Salil Parekh, and his global leadership team,  realized early on the value that advanced digital  technologies like AI and cloud, and more recently,  generative AI, can bring to imagine and execute for  multiple options in the future. They came together as  One Infosys to orchestrate teams that lead the charge to  continually transform Infosys into an organization that truly  realizes human-machine synergies, from fundamentally  rethinking organizational design to segmenting cognitive  tasks to get the right balance between people, technology,  and process. Today, Infosys is steadily progressing towards  a future where we don’t just solve immediate business\nproblems, but continually innovate and architect for  challenges that may emerge in the future. We build it  for ourselves first, and then, deeply rooted in our own  experience, take it widely to our clients.  The awesome possibilities of generative AI, we know from  our own journey to becoming an AI-first enterprise, is not  without its risks. The problems of AI hallucination, systemic  biases, lack of explainability along with plenty of practical,  ethical and intellectual property-related issues remain open  and up for debate. We also know, from our experience,  that the path to scaling AI enterprise-wide is non-linear.  Often, organizations, seeking to mine value from data and  AI models, successfully undertake pilots but fail to factor in  what it will take to scale value across the whole enterprise.  As demands increase, data volumes grow, and complexity  rises, companies find themselves unable to surmount the  associated challenges and start to question the path to  value. Navigating to value-at-scale from AI and retaining  the larger strategic vision while breaking down the tasks  into sequential small wins, is not always intuitive or simple.  With our AI-first strategy, Infosys is guided by that road  map. We are also bringing to our global clients the ability  to accelerate business value and amplify human potential  using AI technologies with Infosys TopazTM. The digital transformation of every industry and every  business, over the last several years, has laid the foundation  to create optionality as we navigate the way forward.  Our clients have always trusted us to assist them not only  to make the right digital investments but to safeguard  these investments for their future. Today, we are excited  by the opportunity and humbled by the responsibility we  have to enable them to bring all their digital capabilities  together to execute quickly and effectively for now, while  developing multiple options to amplify their competitive  advantage and market leadership in an uncertain future.  Our client relevance has never been so compelling, our  investment in employees as continuous and consistent,  and our purpose so keen. We are ready to co-create with  our clients and our entire ecosystem a flexible future that  puts people first and benefits the broader society even as  it propels business forward. After all, like many have said,  imagination is our invisible power to create all things. Our  future can be as bright as we imagine it to be. Nandan M. Nilekani Bengaluru May 29, 2023 Chairman\nNandan M. Nilekani Chairman", "metadata": {"source": "/data/vectordb/chunked/c001329c-5523-42f2-a259-212dd9179611/chunks/2.txt", "chunk_id": "de706", "page_no": 2, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [189.0, 224.0, 4844.0, 3044.0], "doc_name": "AR_2022-23_page-14-17.pdf", "document_id": "c001329c-5523-42f2-a259-212dd9179611"}}, "94a84578-6d19-4592-861b-ad94d8c90db5": {"content": "Letter to the Shareholder Dear shareholder, Financial year 2023 was a strong year for our business. In FY23, we saw growth of over 15%, operating margins  of 21%, and free cash flow of US$2.5 billion. Our attrition  reduced for each quarter of the year. With the changing economic environment, we positioned  our Company to work with clients for their digital  transformation as well as their cost efficiency and  automation programs, enabling us to support them in two  critical areas of interest. We have developed a strong set of capabilities in  generative artificial intelligence to enhance how we enable  our clients to derive value. These capabilities are available  to all our clients in the form of Infosys TopazTM. Our Cobalt capabilities for the cloud continue to resonate  with our clients. Our platforms, including Finacle for banks,  McCamish for insurance, Equinox for commerce, and Helix  for healthcare, are creating strong impact with clients.  During the year, we were recognized by Brand Finance  among the top three most valuable IT services brands  globally. We continue to deepen our engagement with our clients.  The number of clients with over US$100 million in revenue  for the year was at 40. The number of clients with over  US$50 million in revenue for the year was at 75. Our large  deal intensity was strong during the year. We had 95 large  deals with a value of US$9.8 billion in the year. We see  our One Infosys approach helping support our clients by  bringing all our capabilities and the strength of our entire  employee-base to work for their benefit. We recruited over 50,000 college graduates in the year and  ended the year with over 3,40,000 employees. At the end  of the year, 39% of our employees were women.\nOur learning ecosystem enabled over 5.5 million learning  days for our employees during the year.  Last year we returned US$3.1 billion to our shareholders –  US$1.7 billion as dividend and US$1.4 billion through our  share buyback program. At the end of the financial year, we were the leading  company among our peers in total shareholder return over  the past five years. We remain committed to the communities we live and  operate in. With the work of Infosys Foundation, we  support a variety of social causes, including creating  positive impact in healthcare, education, sustainability, and  women empowerment. Our Infosys Springboard initiative  continues to help build digital skills by providing free  learning programs to millions of people around the world. In the past few quarters, we have seen the global  economy dealing with inflation, interest rate increases,  and changes in demand environment for companies in  various industries. Our strength in digital, cloud, and in  automation, along with cost efficiency capabilities have  held us in good stead. These will continue to be critical in  the evolving economic environment. As I look ahead, given the trust of our clients, the  dedication of our employees, the strength of our  capabilities, our One Infosys approach, and the guidance  of our Board, I remain confident of our ability to serve our  clients and continue to create impact for them. With my warmest regards,\nBengaluru May 29, 2023\nSd/- Salil Parekh Chief Executive Officer and Managing Director\nSalil Parekh Chief Executive Officer and  Managing Director", "metadata": {"source": "/data/vectordb/chunked/c001329c-5523-42f2-a259-212dd9179611/chunks/3.txt", "chunk_id": "4f4fa", "page_no": 3, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [189.0, 224.0, 3189.0, 2990.0], "doc_name": "AR_2022-23_page-14-17.pdf", "document_id": "c001329c-5523-42f2-a259-212dd9179611"}}, "7b71267f-ea93-4b61-9a16-4fa861e92b0f": {"content": "Awards and recognitions\nESG Recognized as a constituent of the  Dow Jones Sustainability World  Index for 2022 Secured a place in CDP’s annual  ‘A List’ for leadership in corporate  transparency and performance on  climate change\ntor Advisory Servi e Grrernance\nRecognized in the LEADERSHIP  category in the Indian Corporate  Governance Scorecard  Assessment by  Institutional Investor Advisory Services  (IiAS) for the seventh year in a row Honored at the Asset ESG Corporate  Awards 2022 with a ‘Platinum  Award for excellence in ESG’,  ‘Best Investor Relations Team’, ‘Best  initiative in Diversity and Inclusion’,  and ‘Best initiative in Environmental  Responsibility’\nRecognized as one of  the 2023 World’s Most  Ethical Companies® by  Ethisphere\nAwarded HFS OneOffice™ Award in the  Sustainability category\nRecognized as a leader in Everest  – Sustainability Enablement  Technology Services PEAK Matrix®  Assessment Ranked as a leader in HFS Top 10:  Sustainability Services, 2022 Infosys BPM won the Best CSR  Impact Award at the Corporate Social  Responsibility Summit & Awards 2023  by UBS Forum Recognized as a top ESG performer in  2023 by Sustainalytics Infosys topped the charts in the  CRISIL ESG Leadership Rankings  and was featured in the CRISIL  Sustainability Yearbook, 2022 for the  second consecutive year Secured an ‘AA’ rating on MSCI ESG  Assessment Recognized by EcoVadis with a Gold  medal for the seventh year in a row\nWon the Economic  Times Best  Organizations for  Women Award 2023\nBusiness Ranked in the Top 3 IT Services  Brands in the world and among  the Top 150 Most Valued Brands by  Brand Finance Global 500 2023 report\nHCM EXCELLENCE AWARDS Ny / Brandon Hall GROUE 3\nWon the Gold Award at the  Brandon Hall Group Excellence in  Technology Awards\nRecognized as a Top Employer in  22 countries across Europe, Middle  East, Asia Pacific, and North America  for best-in-class HR practices and  processes\nWon the ‘Most  Outstanding Company  in India – IT Services  Sector’ in Asia’s  Outstanding Companies  Poll 2022 by Asiamoney\nWon the FE CFO Awards 2023 in the  Large Enterprises - Servicing Sector  category. Won Treasury Today Asia’s Top  Treasury Team 2022 award at the  Adam Smith Awards Asia 2022\nNamed in AVTAR Top 10 Best  Companies for Women in India  list in 2022\nTOP 10 BEST COMPANIES FOR WOMEN INDIA 2022 §§} seramount\nRecognized among Kantar’s global 100  most valuable brands in 2022 Recognized as UK’s Best Workplaces™  in Tech 2022 by Great Place to Work® Recognized among Mexico’s Best  HR leaders of 2022 by Great Place  to Work®\nTP ... CERTIFIED EXCELLENCE IN EMPLOYEE CONDITIONS EMPLOYER | 2023 .4\nRecognized as a Global Top  Employer 2023 by the Top  Employers Institute for the 3rd  consecutive year\nInfosys received the Great Place to Work® Certification across five  regions including India, Australia, United Kingdom, Germany, USA,  Canada and Mexico. Infosys BPM received the Great Place to Work®  Certification in the Philippines\nRecognized as one of the “Most  Honored” companies, receiving  multiple awards at the 2022 All- Asia Executive Team Rankings from  Institutional Investor\nInfosys InStep Ranked as the ‘Best  Internship Program’ in the 2023  Vault Firsthand Rankings\nInfosys rated as “Most Noteworthy”  Company by DiversityInc, USA\nRecognized amongst India’s Best  Workplaces™ for Women 2022 by  Great Place to Work®\nWon the ICAI Sustainability  Reporting Awards 2021-22 for Gender  Equality Infosys recognized as the Champion  of Inclusion in the Most Inclusive  Companies Index (MICI) and featured  in the “100 Best – Hall of Fame” by  Avtar & Seramount, 2022\nAC Among Nation-Builders India's Best Employers 202\nVoice of the customer (wrs) TOP 10 1 for\nPositioned as a leader in HFS Top  10: Capital Markets Services, 2022\nAwarded HFS  OneOffice™ Award  in the Innovation  Ecosystem category\nWINNER 2022 ©ONE AWARDS Innovation Ecosystem\nRecognized as ‘GSI Innovation  Partner of the Year 2022’ at  Snowflake Summit Winner of the 2022 Microsoft  Security Modern Endpoint  Management Partner of the Year  Award  Recognized as the Top Service  Provider Across Nordics in  the Whitelane Research and PA  Consulting IT Sourcing Study 2023\nInfosys BPM won in the  International Project of the Year  category with Telefonica UK, at  the Global Sourcing Association  (GSA) UK Awards 2022", "metadata": {"source": "/data/vectordb/chunked/c001329c-5523-42f2-a259-212dd9179611/chunks/4.txt", "chunk_id": "39d51", "page_no": 4, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [185.30333333333334, 223.0, 4888.0, 3093.0], "doc_name": "AR_2022-23_page-14-17.pdf", "document_id": "c001329c-5523-42f2-a259-212dd9179611"}}, "d7a7f81a-3fb8-4f95-a6c8-82da2d7a50c7": {"content": "|\n|\n~ Account Summary PAYMENT RECEIVED | PREVIOUS BALANCE ' B Blen @S2 A 868.00 867.10\n?\nNigam Limited NBMS/BMS Tax Invoice Postage Paid in Advance\n[\nTELEPHONE NUMBER 0488276180\n*)\n4\n‘\nADJUSTMENTS |68 loBE) 000\n01/05/2021 to 31/05/2021 Tariff plaﬁ: 700GB CUL / Speed Upto 10Mbps till 5GB/day beyond that Upto 2Mbps / Voice unlimited.\nAMOUNT PAYABLE 867.00\n4\nTOTAL DUE BOSBHOENSOD: 866.61 Amount in words : Eight Hundred and Sixty Seven Only.\nCURRENT CHARGES dleifiengs enllad 867.51 g\n\"\n|\n=)\n4\n|\nDUE DATE 19/06/2021\nAMOUNT PAYABLE BOSBHOENBD®D 867.00\n=)\n?", "metadata": {"source": "/data/vectordb/chunked/132cddb6-7775-4743-b6bf-671072e0a49b/chunks/1.txt", "chunk_id": "fd6fa", "page_no": 1, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [82.0, 201.0, 2384.0, 1010.0], "doc_name": "invoice2.jpg", "document_id": "132cddb6-7775-4743-b6bf-671072e0a49b"}}, "e79b1245-fbf2-42a6-a686-87c3eea4bbe4": {"content": "Sample Content\nNote: The content present in this pdf is synthetic data generated by AI\nFootball players are the epitome of athleticism and skill on the field. Renowned for their  physical prowess and strategic acumen, these athletes exhibit exceptional teamwork and  individual brilliance. From dazzling dribbles to powerful strikes, football players showcase a  diverse range of talents that captivate fans worldwide. The sport's global appeal is fueled by  iconic players who transcend borders and cultures, becoming household names celebrated for  their contributions to the beautiful game.\nBeyond the pitch, football players often play a crucial role as ambassadors for social causes. Many use  their platform to address issues such as discrimination, inequality, and community development.  Whether they're leading their teams to victory or championing social justice, football players wield  their influence both on and off the field, leaving a lasting impact on the world beyond the realm of  sports.\nFootball Players:\n[{\"Player\": \"Lionel Messi\", \"Club\": \"Paris Saint-Germain\", \"Nationality\": \"Argentine\", \"Goals\": \"21\", \"Assists\": \"12\"}, {\"Player\": \"Cristiano Ronaldo\", \"Club\": \"Manchester United\", \"Nationality\": \"Portuguese\", \"Goals\": \"18\", \"Assists\": \"8\"}, {\"Player\": \"Kylian Mbapp\\u00e9\", \"Club\": \"Real Madrid\", \"Nationality\": \"French\", \"Goals\": \"15\", \"Assists\": \"10\"}, {\"Player\": \"Robert Lewandowski\", \"Club\": \"Bayern Munich\", \"Nationality\": \"Polish\", \"Goals\": \"23\", \"Assists\": \"5\"}, {\"Player\": \"Mohamed Salah\", \"Club\": \"Liverpool\", \"Nationality\": \"Egyptian\", \"Goals\": \"17\", \"Assists\": \"9\"}, {\"Player\": \"Erling Haaland\", \"Club\": \"Borussia Dortmund\", \"Nationality\": \"Norwegian\", \"Goals\": \"19\", \"Assists\": \"6\"}]\nMotoGP riders are the fearless daredevils of the motorcycle racing world, navigating circuits  with astonishing speed and precision. These elite athletes master the art of controlling  powerful, high-performance machines, pushing the boundaries of both man and machine. With  incredible agility and reflexes, MotoGP riders lean into corners at gravity-defying angles,  showcasing an unparalleled combination of skill and bravery. The sport demands not only  physical endurance but also mental fortitude as riders engage in a constant battle against  competitors and the unforgiving twists and turns of the tracks.", "metadata": {"source": "/data/vectordb/chunked/87743d70-e5cc-495c-a03d-15bef7d7778a/chunks/1.txt", "chunk_id": "7b7fd", "page_no": 1, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [300.0, 338.0, 2251.0, 2918.0], "doc_name": "sports_statistics.pdf", "document_id": "87743d70-e5cc-495c-a03d-15bef7d7778a"}}, "00c109fd-1b19-4e78-8cee-6569a3eab776": {"content": "MotoGP Riders:\n[{\"Rider\": \"Marc Marquez\", \"Team\": \"Repsol Honda\", \"Nationality\": \"Spanish\", \"Points\": \"236\", \"Wins\": \"6\", \"Podiums\": \"8\"}, {\"Rider\": \"Fabio Quartararo\", \"Team\": \"Yamaha Factory Racing\", \"Nationality\": \"French\", \"Points\": \"210\", \"Wins\": \"5\", \"Podiums\": \"7\"}, {\"Rider\": \"Jack Miller\", \"Team\": \"Ducati Team\", \"Nationality\": \"Australian\", \"Points\": \"185\", \"Wins\": \"3\", \"Podiums\": \"6\"}, {\"Rider\": \"Joan Mir\", \"Team\": \"Suzuki Ecstar\", \"Nationality\": \"Spanish\", \"Points\": \"162\", \"Wins\": \"2\", \"Podiums\": \"5\"}, {\"Rider\": \"Aleix Espargaro\", \"Team\": \"Aprilia Racing Team\", \"Nationality\": \"Spanish\", \"Points\": \"118\", \"Wins\": \"0\", \"Podiums\": \"3\"}, {\"Rider\": \"Johann Zarco\", \"Team\": \"Pramac Racing\", \"Nationality\": \"French\", \"Points\": \"94\", \"Wins\": \"0\", \"Podiums\": \"2\"}, {\"Rider\": \"Brad Binder\", \"Team\": \"Red Bull KTM Factory\", \"Nationality\": \"South African\", \"Points\": \"73\", \"Wins\": \"0\", \"Podiums\": \"1\"}]\nFormula 1 drivers are the elite of the motorsport world, piloting cutting-edge machines at  breathtaking speeds. Renowned for their precision, reflexes, and mental acuity, these athletes  navigate the most challenging circuits on the planet, pushing the limits of both their vehicles  and themselves. Each F1 driver is a maestro behind the wheel, orchestrating a symphony of  speed and strategy as they compete in a high-stakes global championship that demands  unparalleled skill and commitment.\nF1 drivers are not just athletes but ambassadors for their sport. Their on-track battles, strategic  maneuvers, and dedication to excellence captivate millions of fans worldwide, turning each  Grand Prix into a spectacle that marries cutting-edge technology with the indomitable spirit of  human competition.\nFormula 1 Drivers:\n[{\"Driver\": \"Lewis Hamilton\", \"Team\": \"Mercedes\", \"Nationality\": \"British\", \"Points\": \"263\", \"Wins\": \"5\", \"Podiums\": \"8\"}, {\"Driver\": \"Max Verstappen\", \"Team\": \"Red Bull Racing\", \"Nationality\": \"Dutch\", \"Points\": \"248\", \"Wins\": \"4\", \"Podiums\": \"7\"}, {\"Driver\": \"Valtteri Bottas\", \"Team\": \"Alfa Romeo Racing\", \"Nationality\": \"Finnish\", \"Points\": \"182\", \"Wins\": \"2\", \"Podiums\": \"6\"}, {\"Driver\": \"Charles Leclerc\", \"Team\": \"Scuderia Ferrari\", \"Nationality\": \"Monegasque\", \"Points\": \"158\", \"Wins\": \"1\", \"Podiums\": \"5\"}, {\"Driver\": \"Lando Norris\", \"Team\": \"McLaren\", \"Nationality\": \"British\", \"Points\": \"137\", \"Wins\": \"0\", \"Podiums\": \"4\"}, {\"Driver\": \"Sebastian Vettel\", \"Team\": \"Aston Martin Cognizant\", \"Nationality\": \"German\", \"Points\": \"112\", \"Wins\": \"0\", \"Podiums\": \"3\"}, {\"Driver\": \"Daniel Ricciardo\", \"Team\": \"McLaren\", \"Nationality\": \"Australian\", \"Points\": \"97\", \"Wins\": \"0\", \"Podiums\": \"2\"}, {\"Driver\": \"Pierre Gasly\", \"Team\": \"Scuderia AlphaTauri\", \"Nationality\": \"French\", \"Points\": \"82\", \"Wins\": \"0\", \"Podiums\": \"2\"}, {\"Driver\": \"Fernando Alonso\", \"Team\": \"Alpine\", \"Nationality\": \"Spanish\", \"Points\": \"76\", \"Wins\": \"0\", \"Podiums\": \"1\"}]", "metadata": {"source": "/data/vectordb/chunked/87743d70-e5cc-495c-a03d-15bef7d7778a/chunks/2.txt", "chunk_id": "62bc6", "page_no": 2, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": [300.0, 326.0, 2266.9167500000003, 2696.5991843686866], "doc_name": "sports_statistics.pdf", "document_id": "87743d70-e5cc-495c-a03d-15bef7d7778a"}}, "d75d66e2-279f-46d1-8f27-cafc177a51e8": {"content": "[This content is generated by LLM for the purpose of testing.]\nVirtual Reality (VR) is an immersive technology that simulates a three-dimensional environment, allowing users to interact with and experience artificial worlds as if they were real. It typically involves wearing a VR headset equipped with displays and motion-tracking sensors, along with other peripherals like hand controllers or gloves for interaction.\nThe concept of VR has been around for decades, but recent advancements in hardware and software have made it more accessible and realistic than ever before. VR technology has applications across various industries, including gaming, entertainment, education, healthcare, architecture, and training.\nIn gaming and entertainment, VR offers players a completely new level of immersion, enabling them to step into the virtual worlds of their favorite games and movies. With VR, users can explore fantastical landscapes, engage in thrilling adventures, or even interact with virtual characters and objects.\nIn education, VR has the potential to revolutionize the learning experience by providing students with immersive simulations and interactive lessons. For example, students can virtually visit historical landmarks, explore the human body in detail, or practice real-life skills in a safe and controlled environment.\nIn healthcare, VR is used for training medical professionals, simulating surgical procedures, and treating various mental health conditions such as anxiety and phobias through exposure therapy. VR therapy has shown promising results in helping patients confront and overcome their fears in a controlled virtual environment.\nIn architecture and design, VR allows architects and designers to visualize and explore their creations in a lifelike manner before they are built. Clients can also experience virtual walkthroughs of buildings or interior spaces, providing them with a better understanding of the final product.\nOverall, VR has the potential to transform how we interact with computers and digital content, offering a more immersive and engaging experience across a wide range of applications and industries. As technology continues to evolve, VR is expected to become even more widespread and impactful in the years to come.", "metadata": {"source": "/data/vectordb/chunked/b2ff609c-0c4e-4c7b-9223-e4adb32f2c3a/chunks/1.txt", "chunk_id": "09d2f", "page_no": 1, "sequence_no": 1, "bbox_format": "X1,Y1,X2,Y2", "bbox": null, "doc_name": "vr.txt", "document_id": "b2ff609c-0c4e-4c7b-9223-e4adb32f2c3a"}}}