{"performance": 0, "overview": 1, "business": 2, "highlights": 3, "revenues": 4, "20": 5, "growth": 6, "15": 7, "cc": 8, "digital": 9, "total": 10, "revenue": 11, "62": 12, "25": 13, "operating": 14, "margin": 15, "21": 16, "robust": 17, "basic": 18, "earnings": 19, "per": 20, "share": 21, "par": 22, "value": 23, "57": 24, "63": 25, "consolidated": 26, "cash": 27, "investments": 28, "31": 29, "286cr": 30, "continue": 31, "main": 32, "strong": 33, "liquidity": 34, "position": 35, "dividend": 36, "34": 37, "infosys": 38, "achieved": 39, "industry": 40, "leading": 41, "healthy": 42, "fiscal": 43, "2023": 44, "esg": 45, "vision": 46, "2030": 47, "ambitions": 48, "drive": 49, "stakeholders": 50, "buyback": 51, "completed": 52, "300cr": 53, "average": 54, "price": 55, "539": 56, "06": 57, "return": 58, "equity": 59, "improved": 60, "last": 61, "free": 62, "443cr": 63, "fcf": 64, "conversion": 65, "84": 66, "net": 67, "profit": 68, "large": 69, "deal": 70, "tcv": 71, "contract": 72, "us": 73, "billion": 74, "sustained": 75, "momentum": 76, "wins": 77, "continues": 78, "number": 79, "50": 80, "million": 81, "clients": 82, "75": 83, "11": 84, "client": 85, "metrics": 86, "increase": 87, "tech": 88, "good": 89, "114mn": 90, "lives": 91, "empowered": 92, "via": 93, "solutions": 94, "governance": 95, "education": 96, "healthcare": 97, "carbon": 98, "neutrality": 99, "neutral": 100, "years": 101, "row": 102, "scope": 103, "emissions": 104, "note": 105, "prepared": 106, "ifrs": 107, "flow": 108, "defined": 109, "provided": 110, "activities": 111, "less": 112, "capital": 113, "expenditure": 114, "statement": 115, "flows": 116, "comprise": 117, "equivalents": 118, "current": 119, "non": 120, "excluding": 121, "unquoted": 122, "preference": 123, "shares": 124, "others": 125, "key": 126, "trends": 127, "crore": 128, "except": 129, "data": 130, "market": 131, "capitalization": 132, "notes": 133, "based": 134, "financial": 135, "statements": 136, "attributable": 137, "owners": 138, "company": 139, "offset": 140, "programs": 141, "40": 142, "000": 143, "rural": 144, "families": 145, "benefit": 146, "fy": 147, "46": 148, "767": 149, "24": 150, "095": 151, "92": 152, "394": 153, "18": 154, "212": 155, "981": 156, "71": 157, "72": 158, "351": 159, "women": 160, "employees": 161, "39": 162, "steady": 163, "progress": 164, "towards": 165, "gender": 166, "diversity": 167, "goals": 168, "2022": 169, "641": 170, "22": 171, "110": 172, "52": 173, "02": 174, "162": 175, "16": 176, "311": 177, "963": 178, "70": 179, "104": 180, "706": 181, "2021": 182, "00": 183, "472": 184, "19": 185, "45": 186, "61": 187, "82": 188, "880": 189, "13": 190, "561": 191, "613": 192, "79": 193, "760": 194, "springhiard": 195, "skilling": 196, "5mn": 197, "people": 198, "part": 199, "initiatives": 200, "fresh": 201, "graduates": 202, "hired": 203, "globally": 204, "2020": 205, "90": 206, "791": 207, "594": 208, "38": 209, "97": 210, "73": 211, "214": 212, "12": 213, "780": 214, "331": 215, "55": 216, "966": 217, "2019": 218, "675": 219, "404": 220, "35": 221, "44": 222, "448": 223, "799": 224, "199": 225, "51": 226, "47": 227, "614": 228, "chairman": 229, "message": 230, "navigating": 231, "uncertainty": 232, "one": 233, "overriding": 234, "theme": 235, "defines": 236, "world": 237, "suffused": 238, "placid": 239, "predictable": 240, "behind": 241, "new": 242, "day": 243, "brings": 244, "inputs": 245, "events": 246, "derail": 247, "carefully": 248, "crafted": 249, "models": 250, "constructed": 251, "around": 252, "cocktail": 253, "inflation": 254, "interest": 255, "rates": 256, "geopolitics": 257, "war": 258, "demand": 259, "volatility": 260, "supply": 261, "chain": 262, "dislocations": 263, "shift": 264, "efficiency": 265, "resilience": 266, "security": 267, "stirring": 268, "quickly": 269, "without": 270, "warning": 271, "week": 272, "may": 273, "oscillate": 274, "caution": 275, "optimism": 276, "back": 277, "news": 278, "times": 279, "intense": 280, "great": 281, "short": 282, "term": 283, "pressure": 284, "crunched": 285, "resources": 286, "require": 287, "companies": 288, "must": 289, "become": 290, "better": 291, "efficient": 292, "ability": 293, "resilient": 294, "present": 295, "also": 296, "securing": 297, "future": 298, "easier": 299, "said": 300, "done": 301, "extreme": 302, "surrounds": 303, "creates": 304, "many": 305, "probable": 306, "states": 307, "simply": 308, "prudent": 309, "businesses": 310, "plan": 311, "succeed": 312, "anticipated": 313, "scenario": 314, "instead": 315, "need": 316, "develop": 317, "flexibility": 318, "able": 319, "avoid": 320, "limiting": 321, "choices": 322, "reduce": 323, "concentration": 324, "risk": 325, "adapt": 326, "learn": 327, "thrive": 328, "reality": 329, "era": 330, "optionality": 331, "upon": 332, "take": 333, "various": 334, "forms": 335, "infrastructure": 336, "dynamically": 337, "reconfigure": 338, "way": 339, "work": 340, "remotely": 341, "office": 342, "hybrid": 343, "area": 344, "talent": 345, "building": 346, "deploying": 347, "agile": 348, "learning": 349, "platforms": 350, "hone": 351, "skill": 352, "sets": 353, "match": 354, "technologies": 355, "first": 356, "ai": 357, "architecture": 358, "constantly": 359, "configured": 360, "finding": 361, "right": 362, "balance": 363, "retaining": 364, "core": 365, "working": 366, "partners": 367, "ingrained": 368, "strategy": 369, "execution": 370, "ceo": 371, "salil": 372, "parekh": 373, "global": 374, "leadership": 375, "team": 376, "realized": 377, "early": 378, "advanced": 379, "like": 380, "cloud": 381, "recently": 382, "generative": 383, "bring": 384, "imagine": 385, "execute": 386, "multiple": 387, "options": 388, "came": 389, "together": 390, "orchestrate": 391, "teams": 392, "lead": 393, "charge": 394, "continually": 395, "transform": 396, "organization": 397, "truly": 398, "realizes": 399, "human": 400, "machine": 401, "synergies": 402, "fundamentally": 403, "rethinking": 404, "organizational": 405, "design": 406, "segmenting": 407, "cognitive": 408, "tasks": 409, "get": 410, "technology": 411, "process": 412, "today": 413, "steadily": 414, "progressing": 415, "solve": 416, "immediate": 417, "problems": 418, "innovate": 419, "architect": 420, "challenges": 421, "emerge": 422, "build": 423, "deeply": 424, "rooted": 425, "experience": 426, "widely": 427, "awesome": 428, "possibilities": 429, "know": 430, "journey": 431, "becoming": 432, "enterprise": 433, "risks": 434, "hallucination": 435, "systemic": 436, "biases": 437, "lack": 438, "explainability": 439, "along": 440, "plenty": 441, "practical": 442, "ethical": 443, "intellectual": 444, "property": 445, "related": 446, "issues": 447, "remain": 448, "open": 449, "debate": 450, "path": 451, "scaling": 452, "wide": 453, "linear": 454, "often": 455, "organizations": 456, "seeking": 457, "mine": 458, "successfully": 459, "undertake": 460, "pilots": 461, "fail": 462, "factor": 463, "scale": 464, "across": 465, "whole": 466, "demands": 467, "volumes": 468, "grow": 469, "complexity": 470, "rises": 471, "find": 472, "unable": 473, "surmount": 474, "associated": 475, "start": 476, "question": 477, "larger": 478, "strategic": 479, "breaking": 480, "sequential": 481, "small": 482, "always": 483, "intuitive": 484, "simple": 485, "guided": 486, "road": 487, "map": 488, "bringing": 489, "accelerate": 490, "amplify": 491, "potential": 492, "using": 493, "topaztm": 494, "transformation": 495, "every": 496, "several": 497, "laid": 498, "foundation": 499, "create": 500, "navigate": 501, "forward": 502, "trusted": 503, "assist": 504, "make": 505, "safeguard": 506, "excited": 507, "opportunity": 508, "humbled": 509, "responsibility": 510, "enable": 511, "capabilities": 512, "effectively": 513, "developing": 514, "competitive": 515, "advantage": 516, "uncertain": 517, "relevance": 518, "never": 519, "compelling": 520, "investment": 521, "continuous": 522, "consistent": 523, "purpose": 524, "keen": 525, "ready": 526, "co": 527, "entire": 528, "ecosystem": 529, "flexible": 530, "puts": 531, "benefits": 532, "broader": 533, "society": 534, "even": 535, "propels": 536, "imagination": 537, "invisible": 538, "power": 539, "things": 540, "bright": 541, "nandan": 542, "nilekani": 543, "bengaluru": 544, "29": 545, "letter": 546, "shareholder": 547, "dear": 548, "year": 549, "fy23": 550, "saw": 551, "margins": 552, "attrition": 553, "reduced": 554, "quarter": 555, "changing": 556, "economic": 557, "environment": 558, "positioned": 559, "well": 560, "cost": 561, "automation": 562, "enabling": 563, "support": 564, "two": 565, "critical": 566, "areas": 567, "developed": 568, "set": 569, "artificial": 570, "intelligence": 571, "enhance": 572, "derive": 573, "available": 574, "form": 575, "cobalt": 576, "resonate": 577, "including": 578, "finacle": 579, "banks": 580, "mccamish": 581, "insurance": 582, "equinox": 583, "commerce": 584, "helix": 585, "creating": 586, "impact": 587, "recognized": 588, "brand": 589, "finance": 590, "among": 591, "top": 592, "three": 593, "valuable": 594, "services": 595, "brands": 596, "deepen": 597, "engagement": 598, "100": 599, "intensity": 600, "95": 601, "deals": 602, "see": 603, "approach": 604, "helping": 605, "strength": 606, "employee": 607, "base": 608, "recruited": 609, "college": 610, "ended": 611, "end": 612, "enabled": 613, "days": 614, "returned": 615, "shareholders": 616, "program": 617, "peers": 618, "past": 619, "five": 620, "committed": 621, "communities": 622, "live": 623, "operate": 624, "variety": 625, "social": 626, "causes": 627, "positive": 628, "sustainability": 629, "empowerment": 630, "springboard": 631, "initiative": 632, "help": 633, "skills": 634, "providing": 635, "millions": 636, "quarters": 637, "seen": 638, "economy": 639, "dealing": 640, "rate": 641, "increases": 642, "changes": 643, "industries": 644, "held": 645, "stead": 646, "evolving": 647, "look": 648, "ahead": 649, "given": 650, "trust": 651, "dedication": 652, "guidance": 653, "board": 654, "confident": 655, "serve": 656, "warmest": 657, "regards": 658, "sd": 659, "chief": 660, "executive": 661, "officer": 662, "managing": 663, "director": 664, "awards": 665, "recognitions": 666, "constituent": 667, "dow": 668, "jones": 669, "index": 670, "secured": 671, "place": 672, "cdp": 673, "annual": 674, "list": 675, "corporate": 676, "transparency": 677, "climate": 678, "change": 679, "tor": 680, "advisory": 681, "servi": 682, "grrernance": 683, "category": 684, "indian": 685, "scorecard": 686, "assessment": 687, "institutional": 688, "investor": 689, "iias": 690, "seventh": 691, "honored": 692, "asset": 693, "platinum": 694, "award": 695, "excellence": 696, "best": 697, "relations": 698, "inclusion": 699, "environmental": 700, "ethisphere": 701, "awarded": 702, "hfs": 703, "oneoffice": 704, "leader": 705, "everest": 706, "enablement": 707, "peak": 708, "matrix": 709, "ranked": 710, "10": 711, "bpm": 712, "csr": 713, "summit": 714, "ubs": 715, "forum": 716, "performer": 717, "sustainalytics": 718, "topped": 719, "charts": 720, "crisil": 721, "rankings": 722, "featured": 723, "yearbook": 724, "second": 725, "consecutive": 726, "aa": 727, "rating": 728, "msci": 729, "ecovadis": 730, "gold": 731, "medal": 732, "150": 733, "valued": 734, "500": 735, "report": 736, "hcm": 737, "ny": 738, "brandon": 739, "hall": 740, "groue": 741, "group": 742, "employer": 743, "countries": 744, "europe": 745, "middle": 746, "east": 747, "asia": 748, "pacific": 749, "north": 750, "america": 751, "class": 752, "hr": 753, "practices": 754, "processes": 755, "outstanding": 756, "india": 757, "sector": 758, "poll": 759, "asiamoney": 760, "seramount": 761, "fe": 762, "cfo": 763, "enterprises": 764, "servicing": 765, "treasury": 766, "adam": 767, "smith": 768, "named": 769, "avtar": 770, "kantar": 771, "uk": 772, "workplaces": 773, "mexico": 774, "leaders": 775, "tp": 776, "certified": 777, "conditions": 778, "employers": 779, "institute": 780, "3rd": 781, "received": 782, "certification": 783, "regions": 784, "australia": 785, "united": 786, "kingdom": 787, "germany": 788, "usa": 789, "canada": 790, "philippines": 791, "receiving": 792, "instep": 793, "internship": 794, "vault": 795, "firsthand": 796, "rated": 797, "noteworthy": 798, "diversityinc": 799, "amongst": 800, "icai": 801, "reporting": 802, "equality": 803, "champion": 804, "inclusive": 805, "mici": 806, "fame": 807, "ac": 808, "nation": 809, "builders": 810, "202": 811, "markets": 812, "winner": 813, "innovation": 814, "gsi": 815, "partner": 816, "snowflake": 817, "microsoft": 818, "modern": 819, "endpoint": 820, "management": 821, "service": 822, "provider": 823, "nordics": 824, "whitelane": 825, "research": 826, "pa": 827, "consulting": 828, "sourcing": 829, "study": 830, "international": 831, "project": 832, "telefonica": 833, "association": 834, "gsa": 835, "voice": 836, "customer": 837, "wrs": 838}